/*------------------------------------------------*/
/* --- ºê¾§¿Æ¼¼ STCMCU ---------------------------*/
/* --- Mobile: (86)13922805190 -------------------*/
/* --- Fax: 86-755-82944243 ----------------------*/
/* --- Tel: 86-755-82948412 ----------------------*/
/* --- Web: www.STCMCU.com -----------------------*/
/* ÊÊÓÃÓÚ: STC12C5AxxX   STC12LE5AxxX ------------*/
/* ------- STC12C5AxxCPP STC12LE5AxxCPP ----------*/
/* ------- STC12C5AxxAD  STC12LE5AxxAD  ----------*/
/* ------- STC12C5AxxS2  STC12LE5AxxS2  ----------*/
/* ------- IAP12C5Axx    IAP12LE5Axx    ----------*/
/* ------- IAP12C5AxxCPP IAP12LE5AxxCPP ----------*/
/* ------- IAP12C5AxxAD  IAP12LE5AxxAD  ----------*/
/* ------- IAP12C5AxxS2  IAP12LE5AxxS2  ----------*/
/*------------------------------------------------*/

#ifndef __STC12C5A_H__
#define __STC12C5A_H__

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  PSW        =   0xd0;       //³ÌÐò×´Ì¬×Ö            Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                CY      AC      F0      RS1     RS0     OV      F1      P
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

sbit CY         =   PSW^7;      //½øÎ»±êÖ¾
sbit AC         =   PSW^6;      //¸¨Öú½øÎ»±êÖ¾
sbit F0         =   PSW^5;      //ÓÃ»§±êÖ¾
sbit RS1        =   PSW^4;      //¼Ä´æÆ÷×éÑ¡ÔñÎ»1
sbit RS0        =   PSW^3;      //¼Ä´æÆ÷×éÑ¡ÔñÎ»0
sbit OV         =   PSW^2;      //Òç³ö±êÖ¾
sbit P          =   PSW^0;      //ACCµÄÅ¼Ð£ÑéÎ»

/////////////////////////////////

sfr  ACC        =   0xe0;       //ÀÛ¼ÓÆ÷                Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

sbit ACC7       =   ACC^7;      //ÀÛ¼ÓÆ÷µÚ7Î»
sbit ACC6       =   ACC^6;      //ÀÛ¼ÓÆ÷µÚ6Î»
sbit ACC5       =   ACC^5;      //ÀÛ¼ÓÆ÷µÚ5Î»
sbit ACC4       =   ACC^4;      //ÀÛ¼ÓÆ÷µÚ4Î»
sbit ACC3       =   ACC^3;      //ÀÛ¼ÓÆ÷µÚ3Î»
sbit ACC2       =   ACC^2;      //ÀÛ¼ÓÆ÷µÚ2Î»
sbit ACC1       =   ACC^1;      //ÀÛ¼ÓÆ÷µÚ1Î»
sbit ACC0       =   ACC^0;      //ÀÛ¼ÓÆ÷µÚ0Î»

/////////////////////////////////

sfr  B          =   0xf0;       //B¼Ä´æÆ÷               Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  SP         =   0x81;       //¶ÑÕ»Ö¸Õë              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0111      0       0       0       0       0       1       1       1

/////////////////////////////////

sfr  DPL        =   0x82;       //Êý¾ÝÖ¸ÕëµÍ×Ö½Ú        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  DPH        =   0x83;       //Êý¾ÝÖ¸Õë¸ß×Ö½Ú        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  PCON       =   0x87;       //µçÔ´¿ØÖÆ¼Ä´æÆ÷        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                SMOD    SMOD0   LVDF    POF     GF1     GF0     PD      IDL
                                //³õÊ¼Öµ=0011,0000      0       0       1       1       0       0       0       0

#define SMOD        0x80        //´®¿Ú²¨ÌØÂÊ±¶ËÙÎ»,ÖÃ1¿ÉÊ¹²¨ÌØÂÊ¿ì1±¶
#define SMOD0       0x40        //FE/SM0Ñ¡ÔñÎ»,0:SCON.7ÎªSM0 1:SCON.7ÎªFE
#define LVDF        0x20        //µÍÑ¹¼ì²âÖÐ¶ÏÇëÇóÎ»,ÓÉÓ²¼þÖÃ1,ÐèÓÉÈí¼þÇå0
#define POF         0x10        //ÉÏµç¸´Î»±êÖ¾Î»,ÉÏµçÊ±ÓÉÓ²¼þÖÃ1,ÐèÓÉÈí¼þÇå0
#define GF1         0x08        //Í¨ÓÃ±êÖ¾Î»1
#define GF0         0x04        //Í¨ÓÃ±êÖ¾Î»0
#define PD          0x02        //µôµç¿ØÖÆÎ»,Ð´1¿ÉÒÔÊ¹MCU½øÈëPowerDownÄ£Ê½
#define IDL         0x01        //¿ÕÏÐ¿ØÖÆÎ»,Ð´1¿ÉÒÔÊ¹MCU½øÈëIdleÄ£Ê½

/////////////////////////////////

sfr  WAKE_CLKO  =   0x8f;       //µôµç»½ÐÑ/Ê±ÖÓÊä³ö¿ØÖÆ Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö          PCAWAKEUP RXDPINIE T1PINIE T0PINIE LVD_WAKEUP BRTCLKO T1VLKO  T0CLKO
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define PCAWAKEUP   0x80        //ÔÊÐíPCAµÄÉÏÉýÑØ/ÏÂ½µÑØÖÐ¶Ï»½ÐÑµôµçMCU
#define RXD_PIN_IE  0x40        //ÔÊÐíRXD(P3.0)ÏÂ½µÑØÖÃÎ»RIÖÐ¶ÏÊ±»½ÐÑµôµçMCU(±ØÐë´ò¿ªÏàÓ¦ÖÐ¶Ï)
#define T1_PIN_IE   0x20        //ÔÊÐíT1(P3.5)ÏÂ½µÑØÖÃÎ»T1ÖÐ¶ÏÊ±»½ÐÑµôµçMCU(±ØÐë´ò¿ªÏàÓ¦ÖÐ¶Ï)
#define T0_PIN_IE   0x10        //ÔÊÐíT0(P3.4)ÏÂ½µÑØÖÃÎ»T0ÖÐ¶ÏÊ±»½ÐÑµôµçMCU(±ØÐë´ò¿ªÏàÓ¦ÖÐ¶Ï)
#define LVD_WAKEUP  0x08        //ÔÊÐíLVD(P4.6)µÄµÍÑ¹¼ì²âÖÐ¶Ï»½ÐÑµôµçMCU(±ØÐë´ò¿ªÏàÓ¦ÖÐ¶Ï)
#define BRTCLKOEN   0x04        //´ò¿ªP1.0½ÅµÄBRTÊ±ÖÓÒç³öÂö³å,Êä³öµÄÊ±ÖÓÆµÂÊÎª1/2±¶µÄBRTÒç³öÂÊ
#define T1CLKOEN    0x02        //´ò¿ªP3.5½ÅµÄ¶¨Ê±Æ÷1Ê±ÖÓÒç³öÂö³å,Êä³öµÄÊ±ÖÓÆµÂÊÎª1/2±¶µÄT1Òç³öÂÊ
#define T0CLKOEN    0x01        //´ò¿ªP3.4½ÅµÄ¶¨Ê±Æ÷0Ê±ÖÓÒç³öÂö³å,Êä³öµÄÊ±ÖÓÆµÂÊÎª1/2±¶µÄT0Òç³öÂÊ

/////////////////////////////////

sfr  CLK_DIV    =   0x97;       //Ê±ÖÓ·ÖÆµ¼Ä´æÆ÷        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       -       CLKS2   CLKS1   CLKS0
                                //³õÊ¼Öµ=xxxx,x000      x       x       x       x       x       0       0       0

#define FOSCD1      0x00        //ÏµÍ³Ê±ÖÓÎªFosc
#define FOSCD2      0x01        //ÏµÍ³Ê±ÖÓÎªFosc/2
#define FOSCD4      0x02        //ÏµÍ³Ê±ÖÓÎªFosc/4
#define FOSCD8      0x03        //ÏµÍ³Ê±ÖÓÎªFosc/8
#define FOSCD16     0x04        //ÏµÍ³Ê±ÖÓÎªFosc/16
#define FOSCD32     0x05        //ÏµÍ³Ê±ÖÓÎªFosc/32
#define FOSCD64     0x06        //ÏµÍ³Ê±ÖÓÎªFosc/64
#define FOSCD128    0x07        //ÏµÍ³Ê±ÖÓÎªFosc/128

/////////////////////////////////

sfr  BUS_SPEED  =   0xa1;       //Êý¾Ý×ÜÏßËÙ¶È¿ØÖÆÆ÷    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       ALES1   ALES0   -       RWS2    RWS1    RWS0
                                //³õÊ¼Öµ=xx10,x011      x       x       1       0       x       0       1       1

#define ALES1       0x20        //P0µØÖ·½¨Á¢Ê±¼äºÍ±£³ÖÊ±¼äµ½ALEÐÅºÅµÄÏÂ½µÑØµÄÊ±ÖÓÊý
#define ALES0       0x10        //ALES1/ALES0=0/0:1¸öÊ±ÖÓ 0/1:2¸öÊ±ÖÓ 1/0:3¸öÊ±ÖÓ 1/1:4¸öÊ±ÖÓ

#define RWS2        0x04        //MOVXÖ¸ÁîµÄÊ±ÖÓÊý
#define RWS1        0x02        //RWS2/RWS1/RWS0=000:1¸öÊ±ÖÓ 001:2¸öÊ±ÖÓ 010:3¸öÊ±ÖÓ 011:4¸öÊ±ÖÓ
#define RWS0        0x01        //               100:5¸öÊ±ÖÓ 101:6¸öÊ±ÖÓ 110:7¸öÊ±ÖÓ 111:8¸öÊ±ÖÓ

/////////////////////////////////

sfr  WDT_CONTR  =   0xc1;       //¿´ÃÅ¹·¶¨Ê±Æ÷¿ØÖÆÆ÷    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö             WDT_FLAG   -       EN_WDT  CLR_WDT IDL_WDT PS2     PS1     PS0
                                //³õÊ¼Öµ=0x00,0000      0       x       0       0       0       0       0       0

#define WDT_FLAG    0x80        //¿´ÃÅ¹·¸´Î»±êÖ¾,µ±¿´ÃÅ¹·Òç³ö²úÉú¸´Î»ºó,Ó²¼þ×Ô¶¯ÖÃ1,ÐèÒªÓÉÈí¼þÇå0
#define EN_WDT      0x20        //Èí¼þÊ¹ÄÜ¿´ÃÅ¹·,´ò¿ªºó²»ÄÜÓÃÈí¼þµÄ·½Ê½¹Ø±Õ
#define CLR_WDT     0x10        //Çå¿´ÃÅ¹·¶¨Ê±Æ÷
#define IDLE_WDT    0x08        //IDLEÄ£Ê½ÏÂ,¿´ÃÅ¹·¶¨Ê±Æ÷ÊÇ·ñ¼ÌÐø¼ÆÊ±

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  AUXR       =   0x8e;       //¸¨Öú¼Ä´æÆ÷            Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                T0x12   T1x12   UM0x6   BRTR    S2SMOD  BRTx12  EXTRAM  S1BRS
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define T0x12       0x80        //¶¨Ê±Æ÷0Ê±ÖÓ¿ØÖÆ,0:Fosc/12(´«Í³µÄ12·ÖÆµ) 1:Fosc/1(1TÄ£Ê½,²»·ÖÆµ,¼´12±¶ÓÚ´«Í³ËÙ¶È)
#define T1x12       0x40        //¶¨Ê±Æ÷1Ê±ÖÓ¿ØÖÆ,0:Fosc/12(´«Í³µÄ12·ÖÆµ) 1:Fosc/1(1TÄ£Ê½,²»·ÖÆµ,¼´12±¶ÓÚ´«Í³ËÙ¶È)
#define UR0x6       0x20        //´®¿ÚÄ£Ê½0µÄÊ±ÖÓ¿ØÖÆ,0:Fosc/12(´«Í³µÄ12·ÖÆµ) 1:Fosc/2(2·ÖÆµ,,¼´6±¶ÓÚ´«Í³ËÙ¶È)
#define BRTR        0x10        //¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷Æô¶¯¿ØÖÆÎ»,1:Æô¶¯¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷ 0:Í£Ö¹¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷
#define S2SMOD      0x08        //´®¿Ú2²¨ÌØÂÊ±¶ËÙÎ»,ÖÃ1¿ÉÊ¹´®¿Ú2µÄ²¨ÌØÂÊ¿ì1±¶
#define BRTx12      0x04        //¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷Ê±ÖÓ¿ØÖÆ,0:Fosc/12(´«Í³µÄ12·ÖÆµ) 1:Fosc/1(1TÄ£Ê½,²»·ÖÆµ,¼´12±¶ÓÚ´«Í³ËÙ¶È)
#define EXTRAM      0x02        //ÄÚ²¿À©Õ¹RAM½ûÄÜÎ»,0:ÄÚ²¿À©Õ¹RAMÓÐÐ§ 1:½ûÓÃÄÚ²¿À©Õ¹RAM
#define S1BRS       0x01        //´®¿Ú1µÄ²¨ÌØÂÊ·¢ÉúÆ÷Ñ¡ÔñÎ»,0:¶¨Ê±Æ÷1 1:¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷(×¢Òâ´®¿Ú2Ö»ÄÜ¹»Ê¹ÓÃ¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷)

/////////////////////////////////

sfr  AUXR1      =   0xa2;       //¸¨Öú¼Ä´æÆ÷1           Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       PCA_P4  SPI_P4  S2_P4   GF2     ADRJ    -       DPS
                                //³õÊ¼Öµ=x000,00x0      x       0       0       0       0       0       x       0

#define PCA_P4      0x40        //½«PCA¿ÚÓ³Éäµ½P4¿Ú,0:ECI(P1.2)CEX0(P1.3)CEX1(P1.4) 1:ECI(P4.1)CEX0(P4.2)CEX1(P4.3)
#define SPI_P4      0x20        //½«SPI¿ÚÓ³Éäµ½P4¿Ú,0:SCLK(P1.7)MISO(P1.6)MOSI(P1.5)SS(P1.4) 1:SCLK(P4.3)MISO(P4.2)MOSI(P4.1)SS(P4.0)
#define S2_P4       0x10        //½«´®¿Ú2Ó³Éäµ½P4¿Ú,0:RXD2(P1.2)TXD2(P1.3) 1:RXD2(P4.2)TXD2(P4.3)
#define GF2         0x08        //Í¨ÓÃ±êÖ¾Î»2
#define ADRJ        0x04        //ADC½á¹ûµ÷Õû,0:{ADC_RES[9876,5432],ADC_RESL[----,--10]} 1:{ADC_RES[----,--98],ADC_RESL[7654,3210]}
#define DPS         0x01        //DPTR0/DPTR1Ñ¡ÔñÎ»,0:DPTR0 1:DPTR1

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  P0         =   0x80;       //I/O¶Ë¿Ú0              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                P0.7    P0.6    P0.5    P0.4    P0.3    P0.2    P0.1    P0.0
                                //³õÊ¼Öµ=1111,1111      1       1       1       1       1       1       1       1

sbit P07        =   P0^7;       //I/O¿ÚP0.7
sbit P06        =   P0^6;       //I/O¿ÚP0.6
sbit P05        =   P0^5;       //I/O¿ÚP0.5
sbit P04        =   P0^4;       //I/O¿ÚP0.4
sbit P03        =   P0^3;       //I/O¿ÚP0.3
sbit P02        =   P0^2;       //I/O¿ÚP0.2
sbit P01        =   P0^1;       //I/O¿ÚP0.1
sbit P00        =   P0^0;       //I/O¿ÚP0.0

/////////////////////////////////

sfr  P1         =   0x90;       //I/O¶Ë¿Ú0              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                P1.7    P1.6    P1.5    P1.4    P1.3    P1.2    P1.1    P1.0
                                //³õÊ¼Öµ=1111,1111      1       1       1       1       1       1       1       1

sbit P17        =   P1^7;       //I/O¿ÚP1.7
sbit P16        =   P1^6;       //I/O¿ÚP1.6
sbit P15        =   P1^5;       //I/O¿ÚP1.5
sbit P14        =   P1^4;       //I/O¿ÚP1.4
sbit P13        =   P1^3;       //I/O¿ÚP1.3
sbit P12        =   P1^2;       //I/O¿ÚP1.2
sbit P11        =   P1^1;       //I/O¿ÚP1.1
sbit P10        =   P1^0;       //I/O¿ÚP1.0

sbit ADCIN7     =   P1^7;       //ADCÍ¨µÀ7µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN6     =   P1^6;       //ADCÍ¨µÀ6µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN5     =   P1^5;       //ADCÍ¨µÀ5µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN4     =   P1^4;       //ADCÍ¨µÀ4µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN3     =   P1^3;       //ADCÍ¨µÀ3µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN2     =   P1^2;       //ADCÍ¨µÀ2µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN1     =   P1^1;       //ADCÍ¨µÀ1µÄÄ£ÄâÐÅºÅÊäÈë½Å
sbit ADCIN0     =   P1^0;       //ADCÍ¨µÀ0µÄÄ£ÄâÐÅºÅÊäÈë½Å

sbit SPISCLK    =   P1^7;       //SPI×ÜÏßµÄÊ±ÖÓ½Å
sbit SPIMISO    =   P1^6;       //SPI×ÜÏßµÄÖ÷³ö´ÓÈë½Å
sbit SPIMOSI    =   P1^5;       //SPI×ÜÏßµÄÖ÷Èë´Ó³ö½Å
sbit SPISS      =   P1^4;       //SPI×ÜÏßµÄ´Ó»úÑ¡Ôñ½Å

sbit CEX1       =   P1^4;       //±È½Ï/²¶»ñ/PWM1Íâ²¿Òý½Å
sbit CEX0       =   P1^3;       //±È½Ï/²¶»ñ/PWM0Íâ²¿Òý½Å
sbit ECI        =   P1^2;       //±È½Ï/²¶»ñ/PWMÄ£¿éµÄÍâ²¿Ê±ÖÓÊäÈë½Å(×î´óÖµÎªFosc/2)

sbit TXD2       =   P1^3;       //´®¿Ú2Êý¾ÝÊä³ö½Å
sbit RXD2       =   P1^2;       //´®¿Ú2Êý¾ÝÊäÈë½Å

sbit BRTCLKO    =   P1^0;       //BRTÊ±ÖÓÒç³öÂö³åÊä³ö½Å

/////////////////////////////////

sfr  P2         =   0xa0;       //I/O¶Ë¿Ú2              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                P2.7    P2.6    P2.5    P2.4    P2.3    P2.2    P2.1    P2.0
                                //³õÊ¼Öµ=1111,1111      1       1       1       1       1       1       1       1

sbit P27        =   P2^7;       //I/O¿ÚP2.7
sbit P26        =   P2^6;       //I/O¿ÚP2.6
sbit P25        =   P2^5;       //I/O¿ÚP2.5
sbit P24        =   P2^4;       //I/O¿ÚP2.4
sbit P23        =   P2^3;       //I/O¿ÚP2.3
sbit P22        =   P2^2;       //I/O¿ÚP2.2
sbit P21        =   P2^1;       //I/O¿ÚP2.1
sbit P20        =   P2^0;       //I/O¿ÚP2.0

/////////////////////////////////

sfr  P3         =   0xb0;       //I/O¶Ë¿Ú3              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                P3.7    P3.6    P3.5    P3.4    P3.3    P3.2    P3.1    P3.0
                                //³õÊ¼Öµ=1111,1111      1       1       1       1       1       1       1       1

sbit P37        =   P3^7;       //I/O¿ÚP3.7
sbit P36        =   P3^6;       //I/O¿ÚP3.6
sbit P35        =   P3^5;       //I/O¿ÚP3.5
sbit P34        =   P3^4;       //I/O¿ÚP3.4
sbit P33        =   P3^3;       //I/O¿ÚP3.3
sbit P32        =   P3^2;       //I/O¿ÚP3.2
sbit P31        =   P3^1;       //I/O¿ÚP3.1
sbit P30        =   P3^0;       //I/O¿ÚP3.0

sbit RXD        =   P3^0;       //´®¿Ú1µÄÊý¾Ý½ÓÊÕ¿Ú
sbit TXD        =   P3^1;       //´®¿Ú1µÄÊý¾Ý·¢ËÍ¿Ú
sbit INT0       =   P3^2;       //Íâ²¿ÖÐ¶Ï0µÄÐÅºÅÊäÈë¿Ú
sbit INT1       =   P3^3;       //Íâ²¿ÖÐ¶Ï1µÄÐÅºÅÊä³ö¿Ú
sbit T0         =   P3^4;       //¶¨Ê±Æ÷0µÄÍâ²¿ÐÅºÅÊäÈë¿Ú
sbit T1         =   P3^5;       //¶¨Ê±Æ÷1µÄÍâ²¿ÐÅºÅÊäÈë¿Ú
sbit WR         =   P3^6;       //Íâ²¿Êý¾Ý´æ´¢Æ÷µÄÐ´ÐÅºÅ
sbit RD         =   P3^7;       //Íâ²¿Êý¾Ý´æ´¢Æ÷µÄ¶ÁÐÅºÅ

sbit T0CLKO     =   P3^4;       //¶¨Ê±Æ÷0µÄÊ±ÖÓÒç³öÂö³åÊä³ö½Å
sbit T1CLKO     =   P3^5;       //¶¨Ê±Æ÷1µÄÊ±ÖÓÒç³öÂö³åÊä³ö½Å

/////////////////////////////////

sfr  P4         =   0xc0;       //I/O¶Ë¿Ú4              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                P4.7    P4.6    P4.5    P4.4    P4.3    P4.2    P4.1    P4.0
                                //³õÊ¼Öµ=1111,1111      1       1       1       1       1       1       1       1

sbit P47        =   P4^7;       //I/O¿ÚP4.7
sbit P46        =   P4^6;       //I/O¿ÚP4.6
sbit P45        =   P4^5;       //I/O¿ÚP4.5
sbit P44        =   P4^4;       //I/O¿ÚP4.4
sbit P43        =   P4^3;       //I/O¿ÚP4.3
sbit P42        =   P4^2;       //I/O¿ÚP4.2
sbit P41        =   P4^1;       //I/O¿ÚP4.1
sbit P40        =   P4^0;       //I/O¿ÚP4.0

sbit RST        =   P4^7;       //¸´Î»½Å,¿ÉÍ¨¹ý±à³ÌÆ÷ÉèÖÃ
sbit EX_LVD     =   P4^6;       //Íâ²¿µÍÑ¹¼ì²âÒý½Å

sbit P4SPISCLK  =   P4^3;       //SPI×ÜÏßµÄÊ±ÖÓ½Å
sbit P4SPIMISO  =   P4^2;       //SPI×ÜÏßµÄÖ÷³ö´ÓÈë½Å
sbit P4SPIMOSI  =   P4^1;       //SPI×ÜÏßµÄÖ÷Èë´Ó³ö½Å
sbit P4SPISS    =   P4^0;       //SPI×ÜÏßµÄ´Ó»úÑ¡Ôñ½Å

sbit P4CEX1     =   P4^3;       //±È½Ï/²¶»ñ/PWM1Íâ²¿Òý½Å
sbit P4CEX0     =   P4^2;       //±È½Ï/²¶»ñ/PWM0Íâ²¿Òý½Å
sbit P4ECI      =   P4^1;       //±È½Ï/²¶»ñ/PWMÄ£¿éµÄÍâ²¿Ê±ÖÓÊäÈë½Å(×î´óÖµÎªFosc/2)

sbit P4TXD2     =   P4^3;       //´®¿Ú2Êý¾ÝÊä³ö½Å
sbit P4RXD2     =   P4^2;       //´®¿Ú2Êý¾ÝÊäÈë½Å

/////////////////////////////////

sfr  P5         =   0xc8;       //I/O¶Ë¿Ú5              Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       P5.3    P5.2    P5.1    P5.0
                                //³õÊ¼Öµ=xxxx,1111      x       x       x       x       1       1       1       1

sbit P53        =   P5^3;       //I/O¿ÚP5.3
sbit P52        =   P5^2;       //I/O¿ÚP5.2
sbit P51        =   P5^1;       //I/O¿ÚP5.1
sbit P50        =   P5^0;       //I/O¿ÚP5.0

/////////////////////////////////

sfr  P1M1       =   0x91;       //I/O¿Ú1Ä£Ê½¿ØÖÆÆ÷1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õ/Ê¼Öµ=0000,0000     0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P1M0       =   0x92;       //I/O¿Ú1Ä£Ê½¿ØÖÆÆ÷0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P0M1       =   0x93;       //I/O¿Ú0Ä£Ê½¿ØÖÆÆ÷1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P0M0       =   0x94;       //I/O¿Ú0Ä£Ê½¿ØÖÆÆ÷0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P2M1       =   0x95;       //I/O¿Ú2Ä£Ê½¿ØÖÆÆ÷1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P2M0       =   0x96;       //I/O¿Ú2Ä£Ê½¿ØÖÆÆ÷0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P3M1       =   0xb1;       //I/O¿Ú3Ä£Ê½¿ØÖÆÆ÷1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õ/Ê¼Öµ=0000,0000     0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P3M0       =   0xb2;       //I/O¿Ú3Ä£Ê½¿ØÖÆÆ÷0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P4M1       =   0xb3;       //I/O¿Ú4Ä£Ê½¿ØÖÆÆ÷1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P4M0       =   0xb4;       //I/O¿Ú4Ä£Ê½¿ØÖÆÆ÷0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  P5M1       =   0xc9;       //I/O¿Ú5Ä£Ê½¿ØÖÆÆ÷1     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=xxxx,0000      x       x       x       x       0       0       0       0

/////////////////////////////////

sfr  P5M0       =   0xca;       //I/O¿Ú5Ä£Ê½¿ØÖÆÆ÷0     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=xxxx,0000      x       x       x       x       0       0       0       0

/////////////////////////////////

// PxM1 PxM0
//  0    0     ×¼Ë«Ïò¿Ú
//  0    1     Ç¿ÍÆÍìÊä³ö
//  1    0     ¸ß×èÊäÈëÌ¬
//  1    1     ¿ªÂ©Êä³ö

/////////////////////////////////

sfr  P1ASF      =   0x9d;       //P1¿ÚÄ£Äâ¹¦ÄÜ¿ØÖÆÎ»    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                P17ASF  P16ASF  P15ASF  P14ASF  P13ASF  P12ASF  P11ASF  P10ASF
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define P17ASF      0x80        //P1.7¿ÚÎªADCÊäÈë½Å
#define P16ASF      0x40        //P1.7¿ÚÎªADCÊäÈë½Å
#define P15ASF      0x20        //P1.7¿ÚÎªADCÊäÈë½Å
#define P14ASF      0x10        //P1.7¿ÚÎªADCÊäÈë½Å
#define P13ASF      0x08        //P1.7¿ÚÎªADCÊäÈë½Å
#define P12ASF      0x04        //P1.7¿ÚÎªADCÊäÈë½Å
#define P11ASF      0x02        //P1.7¿ÚÎªADCÊäÈë½Å
#define P10ASF      0x01        //P1.7¿ÚÎªADCÊäÈë½Å

/////////////////////////////////

sfr  P4SW       =   0xbb;       //P4¿ÚµÄ¹¦ÄÜ¿ª¹Ø        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -    LVD_P4.6 ALE_P4.5 NA_P4.4  -       -       -       -
                                //³õÊ¼Öµ=x000,xxxx      x       0       0       0       x       x       x       x

#define P46EN       0x40        //´«Í³µÄEA½Å 0:ÎªLVDµÄÐÅºÅÒýÈë½Å 1:ÎªP4.6
#define P45EN       0x20        //´«Í³µÄALE½Å 0:ÈÔÎªALE 1:ÎªP4.5
#define P44EN       0x10        //´«Í³µÄPSEN½Å 0:ÎÞÈÎºÎ¹¦ÄÜ 1:ÎªP4.4

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  IE         =   0xa8;       //ÖÐ¶ÏÊ¹ÄÜ¼Ä´æÆ÷        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                EA      ELVD    EADC    ES      ET1     EX1     ET0     EX0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

sbit EA         =   IE^7;       //×ÜÖÐ¶Ï¿ª¹Ø
sbit ELVD       =   IE^6;       //LVDÖÐ¶ÏÊ¹ÄÜÎ»
sbit EADC       =   IE^5;       //ADCÖÐ¶ÏÊ¹ÄÜÎ»
sbit ES         =   IE^4;       //´®¿ÚÖÐ¶ÏÊ¹ÄÜÎ»
sbit ET1        =   IE^3;       //¶¨Ê±Æ÷1ÖÐ¶ÏÊ¹ÄÜÎ»
sbit EX1        =   IE^2;       //Íâ²¿ÖÐ¶Ï1ÖÐ¶ÏÊ¹ÄÜÎ»
sbit ET0        =   IE^1;       //¶¨Ê±Æ÷0ÖÐ¶ÏÊ¹ÄÜÎ»
sbit EX0        =   IE^0;       //Íâ²¿ÖÐ¶Ï0ÖÐ¶ÏÊ¹ÄÜÎ»

/////////////////////////////////

sfr  IE2        =   0xaf;       //ÖÐ¶ÏÊ¹ÄÜ¼Ä´æÆ÷2       Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       -       -       ESPI    ES2
                                //³õÊ¼Öµ=xxxx,xx00      x       x       x       x       x       x       0       0

#define ESPI        0x02        //SPIÖÐ¶ÏÊ¹ÄÜÎ»
#define ES2         0x01        //´®¿Ú2ÖÐ¶ÏÊ¹ÄÜÎ»

/////////////////////////////////

#define X0_INTNO    0           //Íâ²¿ÖÐ¶Ï0ÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª0003H
#define T0_INTNO    1           //¶¨Ê±Æ÷0ÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª000BH
#define X1_INTNO    2           //Íâ²¿ÖÐ¶Ï1ÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª0013H
#define T1_INTNO    3           //¶¨Ê±Æ÷1ÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª001BH
#define UART_INTNO  4           //´®¿ÚÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª0023H
#define ADC_INTNO   5           //ADCÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª002BH
#define LVD_INTNO   6           //LVDÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª0033H
#define UART2_INTNO 8           //´®¿Ú2ÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª0043H
#define SPI_INTNO   9           //SPIÖÐ¶ÏºÅ,Èë¿ÚµØÖ·Îª004BH

/////////////////////////////////

sfr  IP2        =   0xb5;       //ÖÐ¶ÏÓÅÏÈ¼¶¼Ä´æÆ÷2     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       -       -       PSPI    PS2
                                //³õÊ¼Öµ=xxxx,xx00      x       x       x       x       x       x       0       0

#define PSPI        0x02        //SPIÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
#define PS2         0x01        //´®¿Ú2ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»

/////////////////////////////////

sfr  IP2H       =   0xb6;       //ÖÐ¶ÏÓÅÏÈ¼¶¼Ä´æÆ÷2¸ßÎ» Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       -       -       PSPIH   PS2H
                                //³õÊ¼Öµ=xxxx,xx00      x       x       x       x       x       x       0       0

#define PSPIH       0x02        //SPIÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PS2H        0x01        //´®¿Ú2ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»

/////////////////////////////////

sfr  IPH        =   0xb7;       //ÖÐ¶ÏÓÅÏÈ¼¶¼Ä´æÆ÷¸ßÎ»  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                PPCAH   PLVDH   PADCH   PSH     PT1H    PX1H    PT0H    PX0H
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define PPCAH       0x80        //PCAÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PLVDH       0x40        //LVDÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PADCH       0x20        //ADCÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PSH         0x10        //´®¿ÚÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PT1H        0x08        //¶¨Ê±Æ÷1ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PX1H        0x04        //Íâ²¿ÖÐ¶Ï1ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PT0H        0x02        //¶¨Ê±Æ÷0ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»
#define PX0H        0x01        //Íâ²¿ÖÐ¶Ï0ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆ¸ßÎ»

/////////////////////////////////

sfr  IP         =   0xb8;       //ÖÐ¶ÏÓÅÏÈ¼¶¼Ä´æÆ÷      Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                PPCA    PLVD    PADC    PS      PT1     PX1     PT0     PX0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

sbit PPCA       =   IP^7;       //PCAÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PLVD       =   IP^6;       //LVDÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PADC       =   IP^5;       //ADCÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PS         =   IP^4;       //´®¿ÚÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PT1        =   IP^3;       //¶¨Ê±Æ÷1ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PX1        =   IP^2;       //Íâ²¿ÖÐ¶Ï1ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PT0        =   IP^1;       //¶¨Ê±Æ÷0ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»
sbit PX0        =   IP^0;       //Íâ²¿ÖÐ¶Ï0ÖÐ¶ÏÓÅÏÈ¼¶¿ØÖÆµÍÎ»

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  TCON       =   0x88;       //¶¨Ê±Æ÷0/1¿ØÖÆ¼Ä´æÆ÷   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                TF1     TR1     TF0     TR0     IE1     IT1     IE0     IT0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

sbit TF1        = TCON^7;       //¶¨Ê±Æ÷1Òç³ö±êÖ¾,ÓÉÓ²¼þÖÃ1,¿ÉÓÉÈí¼þÇå0»òÕßÔÚÖÐ¶Ï´¦Àí³ÌÐòÍê³ÉºóÓÉÓ²¼þ×Ô¶¯Çå0
sbit TR1        = TCON^6;       //¶¨Ê±Æ÷1µÄÆô¶¯¿ØÖÆÎ»,1:Æô¶¯¶¨Ê±Æ÷ 0:Í£Ö¹¶¨Ê±Æ÷
sbit TF0        = TCON^5;       //¶¨Ê±Æ÷0Òç³ö±êÖ¾,ÓÉÓ²¼þÖÃ1,¿ÉÓÉÈí¼þÇå0»òÕßÔÚÖÐ¶Ï´¦Àí³ÌÐòÍê³ÉºóÓÉÓ²¼þ×Ô¶¯Çå0
sbit TR0        = TCON^4;       //¶¨Ê±Æ÷0µÄÆô¶¯¿ØÖÆÎ»,1:Æô¶¯¶¨Ê±Æ÷ 0:Í£Ö¹¶¨Ê±Æ÷
sbit IE1        = TCON^3;       //Íâ²¿ÖÐ¶Ï1µÄÖÐ¶ÏÇëÇóÎ»,ÓÉÓ²¼þÖÃ1,¿ÉÓÉÈí¼þÇå0»òÕßÔÚÖÐ¶Ï´¦Àí³ÌÐòÍê³ÉºóÓÉÓ²¼þ×Ô¶¯Çå0
sbit IT1        = TCON^2;       //Íâ²¿ÖÐ¶Ï1µÄ´¥·¢ÀàÐÍ,0:µÍµçÆ½´¥·¢Íâ²¿ÖÐ¶Ï 1:ÏÂ½µÑØ´¥·¢Íâ²¿ÖÐ¶Ï
sbit IE0        = TCON^1;       //Íâ²¿ÖÐ¶Ï0µÄÖÐ¶ÏÇëÇóÎ»,ÓÉÓ²¼þÖÃ1,¿ÉÓÉÈí¼þÇå0»òÕßÔÚÖÐ¶Ï´¦Àí³ÌÐòÍê³ÉºóÓÉÓ²¼þ×Ô¶¯Çå0
sbit IT0        = TCON^0;       //Íâ²¿ÖÐ¶Ï0µÄ´¥·¢ÀàÐÍ,0:µÍµçÆ½´¥·¢Íâ²¿ÖÐ¶Ï 1:ÏÂ½µÑØ´¥·¢Íâ²¿ÖÐ¶Ï

/////////////////////////////////

sfr  TMOD       =   0x89;       //¶¨Ê±Æ÷0/1Ä£Ê½¼Ä´æÆ÷   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                GATE    C/T#    M1      M0      GATE    C/T#    M1      M0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define GATE1       0x80        //¶¨Ê±Æ÷1Æô¶¯¿ØÖÆÎ»,0:TR1Îª1Ê±Æô¶¯¶¨Ê±Æ÷1 1:TR1Îª1ÇÒINT1Îª¸ßµçÆ½Ê±²ÅÆô¶¯¶¨Ê±Æ÷1
#define C_T1        0x40        //¶¨Ê±Æ÷/¼ÆÊýÆ÷Ñ¡ÔñÎ»,0:¶¨Ê±Æ÷(Ê±ÖÓÔ´ÎªÄÚ²¿Ê±ÖÓ) 1:¼ÆÊýÆ÷(Ê±ÖÓÔ´ÎªT1Òý½ÅµÄÍâ²¿Ê±ÖÓ)
#define T1_M0       0x00        //¶¨Ê±Æ÷1²Ù×÷Ä£Ê½0:13Î»¶¨Ê±Æ÷
#define T1_M1       0x10        //¶¨Ê±Æ÷1²Ù×÷Ä£Ê½1:16Î»¶¨Ê±Æ÷
#define T1_M2       0x20        //¶¨Ê±Æ÷1²Ù×÷Ä£Ê½2:8Î»×Ô¶¯ÖØÔØ¶¨Ê±Æ÷
#define T1_M3       0x30        //¶¨Ê±Æ÷1²Ù×÷Ä£Ê½3:¶¨Ê±Æ÷1Í£Ö¹
#define GATE0       0x08        //¶¨Ê±Æ÷1Æô¶¯¿ØÖÆÎ»,0:TR0Îª1Ê±Æô¶¯¶¨Ê±Æ÷1 1:TR0Îª1ÇÒINT0Îª¸ßµçÆ½Ê±²ÅÆô¶¯¶¨Ê±Æ÷0
#define C_T0        0x04        //¶¨Ê±Æ÷/¼ÆÊýÆ÷Ñ¡ÔñÎ»,0:¶¨Ê±Æ÷(Ê±ÖÓÔ´ÎªÄÚ²¿Ê±ÖÓ) 1:¼ÆÊýÆ÷(Ê±ÖÓÔ´ÎªT0Òý½ÅµÄÍâ²¿Ê±ÖÓ)
#define T0_M0       0x00        //¶¨Ê±Æ÷0²Ù×÷Ä£Ê½0:13Î»¶¨Ê±Æ÷
#define T0_M1       0x01        //¶¨Ê±Æ÷0²Ù×÷Ä£Ê½1:16Î»¶¨Ê±Æ÷
#define T0_M2       0x02        //¶¨Ê±Æ÷0²Ù×÷Ä£Ê½2:8Î»×Ô¶¯ÖØÔØ¶¨Ê±Æ÷
#define T0_M3       0x03        //¶¨Ê±Æ÷0²Ù×÷Ä£Ê½3:TL0ºÍTH0ÎªÁ½×é¶ÀÁ¢8Î»¶¨Ê±Æ÷

/////////////////////////////////

sfr  TL0        = 0x8a;         //¶¨Ê±Æ÷0µÄµÍ8Î»¼ÆÊýÖµ  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  TL1        = 0x8b;         //¶¨Ê±Æ÷1µÄµÍ8Î»¼ÆÊýÖµ  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  TH0        = 0x8c;         //¶¨Ê±Æ÷0µÄ¸ß8Î»¼ÆÊýÖµ  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  TH1        = 0x8d;         //¶¨Ê±Æ÷1µÄ¸ß8Î»¼ÆÊýÖµ  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  SCON       =   0x98;       //´®¿Ú¿ØÖÆ¼Ä´æÆ÷        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                SM0/FE  SM1     SM2     REN     TB8     RB8     TI      Ri
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

sbit FE         =   SCON^7;     //Ö¡´íÎó¼ì²âÎ»,µ±´®¿ÚÄ£¿éÔÚ½ÓÊÕÊý¾ÝÊ±Ã»ÓÐ¼ì²âµ½ÕýÈ·µÄÍ£Ö¹Î»Ê±,FE±»Ó²¼þÖÃ1,ÐèÒªÓÉÈí¼þÀ´Çå0(µ±SMOD0Îª1Ê±,FEÓÐÐ§)
sbit SM0        =   SCON^7;     //´®¿ÚÄ£Ê½ÉèÖÃÎ»
sbit SM1        =   SCON^6;     //SM0/SM1=0/0:ÒÆÎ»¼Ä´æÆ÷ 0/1:8Î»¿É±ä²¨ÌØÂÊ 1/0:9Î»¹Ì¶¨²¨ÌØÂÊ 1/1:9Î»¿É±ä²¨ÌØÂÊ
sbit SM2        =   SCON^5;     //×Ô¶¯µØÖ·Ê¶±ðÊ¹ÄÜÎ»
sbit REN        =   SCON^4;     //Ê¹ÄÜ´®¿Ú½ÓÊÕÄ£¿é
sbit TB8        =   SCON^3;     //·¢ËÍµÄµÚ9Î»Êý¾Ý
sbit RB8        =   SCON^2;     //½ÓÊÕµÄµÚ9Î»Êý¾Ý
sbit TI         =   SCON^1;     //·¢ËÍÍê³ÉÖÐ¶Ï±êÖ¾
sbit RI         =   SCON^0;     //½ÓÊÕÍê³ÉÖÐ¶Ï±êÖ¾

/////////////////////////////////

sfr  SBUF       =   0x99;       //´®¿Ú½ÓÊÕ/·¢ËÍÊý¾Ý     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=xxxx,xxxx      x       x       x       x       x       x       x       x

/////////////////////////////////

sfr  S2CON      =   0x9a;       //´®¿Ú2¿ØÖÆ¼Ä´æÆ÷       Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                SM0/FE  SM1     SM2     REN     TB8     RB8     TI      Ri
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define S2SM0       0x80        //´®¿Ú2Ä£Ê½ÉèÖÃÎ»
#define S2SM1       0x40        //SM0/SM1=0/0:ÒÆÎ»¼Ä´æÆ÷ 0/1:8Î»¿É±ä²¨ÌØÂÊ 1/0:9Î»¹Ì¶¨²¨ÌØÂÊ 1/1:9Î»¿É±ä²¨ÌØÂÊ
#define S2SM2       0x20        //×Ô¶¯µØÖ·Ê¶±ðÊ¹ÄÜÎ»
#define S2REN       0x10        //Ê¹ÄÜ´®¿Ú2½ÓÊÕÄ£¿é
#define S2TB8       0x08        //·¢ËÍµÄµÚ9Î»Êý¾Ý
#define S2RB8       0x04        //½ÓÊÕµÄµÚ9Î»Êý¾Ý
#define S2TI        0x02        //·¢ËÍÍê³ÉÖÐ¶Ï±êÖ¾
#define S2RI        0x01        //½ÓÊÕÍê³ÉÖÐ¶Ï±êÖ¾

/////////////////////////////////

sfr  S2BUF      =   0x9b;       //´®¿Ú2½ÓÊÕ/·¢ËÍÊý¾Ý    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=xxxx,xxxx      x       x       x       x       x       x       x       x

/////////////////////////////////

sfr  SADDR      =   0xa9;       //´®¿ÚÉè±¸´ÓµØÖ·¼Ä´æÆ÷  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  SADEN      =   0xb9;       //´®¿ÚÉè±¸´ÓµØÖ·ÆÁ±ÎÎ»  Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  BRT        =   0x9c;       //¶ÀÁ¢²¨ÌØÂÊ·¢ÉúÆ÷ÖØÔØÖµBit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  ADC_CONTR  =   0xbc;       //ADC¿ØÖÆ¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö            ADC_POWER  SPEED1 SPEED0 ADC_FLAG ADC_START CHS2    CHS1    CHS0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define ADC_POWER   0x80        //ADCÄ£¿éµçÔ´¿ØÖÆÎ»
#define ADC_SPEEDLL 0x00        //Ã¿´Î×ª»»ÐèÒª420¸öÊ±ÖÓÖÜÆÚ
#define ADC_SPEEDL  0x20        //Ã¿´Î×ª»»ÐèÒª280¸öÊ±ÖÓÖÜÆÚ
#define ADC_SPEEDH  0x40        //Ã¿´Î×ª»»ÐèÒª140¸öÊ±ÖÓÖÜÆÚ
#define ADC_SPEEDHH 0x60        //Ã¿´Î×ª»»ÐèÒª70¸öÊ±ÖÓÖÜÆÚ
#define ADC_FLAG    0x10        //ADC×ª»»Íê³É±êÖ¾
#define ADC_START   0x08        //ADC¿ªÊ¼×ª»»¿ØÖÆÎ»
#define ADC_CHS2    0x04        //ADCÍ¨µÀÑ¡ÔñÎ»2
#define ADC_CHS1    0x02        //ADCÍ¨µÀÑ¡ÔñÎ»1
#define ADC_CHS0    0x01        //ADCÍ¨µÀÑ¡ÔñÎ»0

/////////////////////////////////

sfr  ADC_RES    =   0xbd;       //ADC½á¹û¸ß×Ö½Ú         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  ADC_RESL   =   0xbe;       //ADC½á¹ûµÍ×Ö½Ú         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  IAP_DATA   =   0xc2;       //IAPÊý¾Ý¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=1111,1111      1       1       1       1       1       1       1       1

/////////////////////////////////

sfr  IAP_ADDRH  =   0xc3;       //IAPµØÖ·¸ßÎ»¼Ä´æÆ÷     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  IAP_ADDRL  =   0xc4;       //IAPµØÖ·µÍÎ»¼Ä´æÆ÷     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  IAP_CMD    =   0xc5;       //IAPÃüÁî¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=xxxx,xx00      x       x       x       x       x       x       0       0

#define IAP_IDLE    0x00        //IAP´ý»úÃüÁî
#define IAP_READ    0x01        //IAP¶Á×Ö½ÚÊý¾ÝÃüÁî
#define IAP_PROGRAM 0x02        //IAP×Ö½Ú±à³ÌÃüÁî
#define IAP_ERASE   0x03        //IAPÉÈÇø²Á³ýÃüÁî(Ã¿ÉÈÇø512×Ö½Ú))

/////////////////////////////////

sfr  IAP_TRIG   =   0xc6;       //IAPÃüÁî´¥·¢¼Ä´æÆ÷     Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=xxxx,xxxx      x       x       x       x       x       x       x       x

#define IAP_TRIG0   0x5a        //IAP¹¦ÄÜ´¥·¢ÃüÁî1
#define IAP_TRIG1   0xa5        //IAP¹¦ÄÜ´¥·¢ÃüÁî2

/////////////////////////////////

sfr  IAP_CONTR  =   0xc7;       //IAP¿ØÖÆ¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                IAPEN   SWBS    SWRST   CMD_FAIL -      WT2     WT1     WT0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

#define IAPEN       0x80        //IAPÊ¹ÄÜ¿ª¹Ø
#define SWBS        0x40        //ÈíÆô¶¯Ñ¡Ôñ,0:´ÓÓÃ»§APÆô¶¯ 1:´ÓISPÆô¶¯
#define SWRST       0x20        //´¥·¢Èí¼þ¸´Î»
#define CMD_FAIL    0x10        //IAPÃüÁîÊ§°Ü±êÖ¾

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  SPSTAT     =   0xcd;       //SPI×´Ì¬¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                SPIF    WCOL    -       -       -       -       -       -
                                //³õÊ¼Öµ=11xx,xxxx      1       1       x       x       x       x       x       x

#define SPIF        0x80        //SPI´«ÊäÍê³É±êÖ¾,µ±SPIÖÐ¶ÏÊ¹ÄÜÊ±»á´¥·¢SPIÖÐ¶ÏÇëÇó,ÐèÒªÓÃÈí¼þÏò´ËÎ»Ð´"1"À´Çå0
#define WCOL        0x40        //SPIÐ´³åÍ»±êÖ¾,ÐèÒªÓÃÈí¼þÏò´ËÎ»Ð´"1"À´Çå0

/////////////////////////////////

sfr  SPCTL      =   0xce;       //SPI¿ØÖÆ¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                SSIG    SPEN    DORD    MSTR    CPOL    CPHA    SPR1    SPR0
                                //³õÊ¼Öµ=0000,0100      0       0       0       0       0       1       0       0

#define SSIG        0x80        //SSºöÂÔÎ»,1:ÓÉMSTRÈ·¶¨Ö÷/´Ó 0:ÓÉSS½ÅÈ·¶¨Ö÷/´Ó
#define SPEN        0x40        //SPIÄ£¿éÊ¹ÄÜÎ»
#define DORD        0x20        //SPIÊý¾ÝË³Ðò,1:LSB(ÏÈÊÕ/·¢×îµÍÎ») 0:MSB(ÏÈÊÕ/·¢×î¸ßÎ»)
#define MSTR        0x10        //Ö÷/´ÓÄ£Ê½Ñ¡ÔñÎ»
#define CPOL        0x08        //SPIÊ±ÖÓ¼«ÐÔ
#define CPHA        0x04        //SPIÏàÎ»Ñ¡Ôñ
#define SPSPEEDHH   0x00        //×î¿ìµÄËÙ¶È,CPU_CLK/4
#define SPSPEEDH    0x01        //×î¿ìµÄËÙ¶È,CPU_CLK/16
#define SPSPEEDL    0x02        //×î¿ìµÄËÙ¶È,CPU_CLK/64
#define SPSPEEDLL   0x03        //×î¿ìµÄËÙ¶È,CPU_CLK/128

/////////////////////////////////

sfr  SPDAT      =   0xcf;       //SPIÊý¾Ý¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

sfr  CCON       =   0xd8;       //PCA¿ØÖÆ¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                CF      CR      -       -       -       -       CCF1    CCF0
                                //³õÊ¼Öµ=00xx,xx00      0       0       x       x       x       x       0       0

sbit CF         =   CCON^7;     //PCA¼ÆÊýÆ÷Òç³ö±êÖ¾,µ±PCAÖÐ¶ÏÊ¹ÄÜÊ±»á´¥·¢PCAÖÐ¶ÏÇëÇó,ÐèÒªÓÃÈí¼þÇå0
sbit CR         =   CCON^6;     //PCA¼ÆÊýÆ÷Æô¶¯¿ØÖÆÎ»,Ð´"1"Æô¶¯¶«¼ÆÊýÆ÷
sbit CCF1       =   CCON^1;     //PCAÄ£¿é1ÖÐ¶Ï±êÖ¾,ÐèÒªÓÃÈí¼þÇå0
sbit CCF0       =   CCON^0;     //PCAÄ£¿é0ÖÐ¶Ï±êÖ¾,ÐèÒªÓÃÈí¼þÇå0

/////////////////////////////////

sfr  CMOD       =   0xd9;       //PCAÄ£Ê½¼Ä´æÆ÷         Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                CIDL    -       -       -       CPS2    CPS1    CPS0    ECF
                                //³õÊ¼Öµ=0xxx,0000      0       x       x       x       0       0       0       0

#define CIDL        0x80        //¼ÆÊ±Æ÷ÕóÁÐ¿ÕÏÐ¿ØÖÆ,0:¿ÕÏÐÄ£Ê½ÏÂPCA¼ÌÐø¹¤×÷ 1:¿ÕÏÐÄ£Ê½ÏÂPCAÍ£Ö¹¹¤×÷
#define PCACLK0     0x00        //Fosc/12
#define PCACLK1     0x02        //Fosc/2
#define PCACLK2     0x04        //¶¨Ê±Æ÷0µÄÒç³öÂÊ
#define PCACLK3     0x06        //ECIÍâ²¿Ê±ÖÓ
#define PCACLK4     0x08        //Fosc/1
#define PCACLK5     0x0a        //Fosc/4
#define PCACLK6     0x0c        //Fosc/6
#define PCACLK7     0x0e        //Fosc/8
#define ECF         0x01        //PCA¼ÆÊýÆ÷Òç³öÖÐ¶ÏÔÊÐíÎ»

/////////////////////////////////

sfr  CCAPM0     =   0xda;       //PCAÄ£¿é0Ä£Ê½¼Ä´æÆ÷    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       ECOM0   CAPP0   CAPN0   MAT0    TOG0    PWM0    ECCF0
                                //³õÊ¼Öµ=x000,0000      x       0       0       0       0       0       0       0

#define PCA0_ECOM   0x40        //Ê¹ÄÜ±È½ÏÆ÷0
#define PCA0_CAPP   0x20        //Ê¹ÄÜPCAÄ£¿é0µÄÉÏÉýÑØ²¶»ñ
#define PCA0_CAPN   0x10        //Ê¹ÄÜPCAÄ£¿é0µÄÏÂ½µÑØ²¶»ñ
#define PCA0_MAT    0x08        //Æ¥ÅäÊ¹ÄÜ,µ±PCAµÄ¼ÆÊýÖµÓëÄ£¿é0Éè¶¨µÄÖµÏàÆ¥ÅäÊ±,ÖÃCCON.CCF0
#define PCA0_TOG    0x04        //·­×ª¿ØÖÆÎ»,µ±PCAµÄ¼ÆÊýÖµÓëÄ£¿é0Éè¶¨µÄÖµÏàÆ¥ÅäÊ±,·­×ªCEX0µÄµçÆ½
#define PCA0_PWM    0x02        //Âö¿íµ÷ÖÆÄ£Ê½,Ê¹ÄÜCEX0ÎªÂö¿íµ÷ÖÆÊä³ö¿Ú
#define PCA0_ECCF   0x01        //Ê¹ÄÜCCF0ÖÐ¶Ï

/////////////////////////////////

sfr  CCAPM1     =   0xdb;       //PCAÄ£¿é1Ä£Ê½¼Ä´æÆ÷    Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       ECOM1   CAPP1   CAPN1   MAT1    TOG1    PWM1    ECCF1
                                //³õÊ¼Öµ=x000,0000      x       0       0       0       0       0       0       0

#define PCA1_ECOM   0x40        //Ê¹ÄÜ±È½ÏÆ÷1
#define PCA1_CAPP   0x20        //Ê¹ÄÜPCAÄ£¿é1µÄÉÏÉýÑØ²¶»ñ
#define PCA1_CAPN   0x10        //Ê¹ÄÜPCAÄ£¿é1µÄÏÂ½µÑØ²¶»ñ
#define PCA1_MAT    0x08        //Æ¥ÅäÊ¹ÄÜ,µ±PCAµÄ¼ÆÊýÖµÓëÄ£¿é1Éè¶¨µÄÖµÏàÆ¥ÅäÊ±,ÖÃCCON.CCF1
#define PCA1_TOG    0x04        //·­×ª¿ØÖÆÎ»,µ±PCAµÄ¼ÆÊýÖµÓëÄ£¿é1Éè¶¨µÄÖµÏàÆ¥ÅäÊ±,·­×ªCEX1µÄµçÆ½
#define PCA1_PWM    0x02        //Âö¿íµ÷ÖÆÄ£Ê½,Ê¹ÄÜCEX1ÎªÂö¿íµ÷ÖÆÊä³ö¿Ú
#define PCA1_ECCF   0x01        //Ê¹ÄÜCCF1ÖÐ¶Ï

/////////////////////////////////

//CCAPM0   -   ECOM CAPP CAPN MAT  TOG  PWM  CCF
// 00H     0    0    0    0    0    0    0    0     ÎÞ²Ù×÷,´ý»ú×´Ì¬
// 42H     0    1    0    0    0    0    1    0     8Î»PWMÊä³ö,ÎÞÖÐ¶Ï
// 63H     0    1    1    0    0    0    1    1     8Î»PWMÊä³ö,²úÉúCEX0ÉÏÉýÑØÖÐ¶Ï
// 53H     0    1    0    1    0    0    1    1     8Î»PWMÊä³ö,²úÉúCEX0ÏÂ½µÑØÖÐ¶Ï
// 73H     0    1    1    1    0    0    1    1     8Î»PWMÊä³ö,²úÉúCEX0Ìø±äÖÐ¶Ï
// 20H     0    x    1    0    0    0    0    0     16Î»²¶»ñÄ£Ê½,CEX0ÉÏÉýÑØ´¥·¢²¶»ñ
// 10H     0    x    0    1    0    0    0    0     16Î»²¶»ñÄ£Ê½,CEX0ÏÂ½µÑØ´¥·¢²¶»ñ
// 30H     0    x    1    1    0    0    0    0     16Î»²¶»ñÄ£Ê½,CEX0Ìø±ä´¥·¢²¶»ñ
// 48H     0    1    0    0    1    0    0    0     16Î»Èí¼þ¶¨Ê±Æ÷
// 4CH     0    1    0    0    1    1    0    0     16Î»¸ßËÙÂö³åÊä³ö

/////////////////////////////////

sfr  CL         =   0xe9;       //PCA¼ÆÊýÆ÷µÍ8Î»        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CH         =   0xf9;       //PCA¼ÆÊýÆ÷¸ß8Î»        Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP0L     =   0xea;       //PCAÄ£¿é0¼Ä´æÆ÷µÍ8Î»   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP1L     =   0xeb;       //PCAÄ£¿é1¼Ä´æÆ÷µÍ8Î»   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP0H     =   0xfa;       //PCAÄ£¿é0¼Ä´æÆ÷¸ß8Î»   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  CCAP1H     =   0xfb;       //PCAÄ£¿é1¼Ä´æÆ÷¸ß8Î»   Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //³õÊ¼Öµ=0000,0000      0       0       0       0       0       0       0       0

/////////////////////////////////

sfr  PCA_PWM0   =   0xf2;       //PCA0Ä£Ê½PWM¸¨Öú¼Ä´æÆ÷ Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       -       -       EPC0H   EPC0L
                                //³õÊ¼Öµ=xxxx,xx00      x       x       x       x       x       x       0       0

/////////////////////////////////

sfr  PCA_PWM1   =   0xf3;       //PCA1Ä£Ê½PWM¸¨Öú¼Ä´æÆ÷ Bit7    Bit6    Bit5    Bit4    Bit3    Bit2    Bit1    Bit0
                                //Î»ÃèÊö                -       -       -       -       -       -       EPC1H   EPC1L
                                //³õÊ¼Öµ=xxxx,xx00      x       x       x       x       x       x       0       0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#endif
